import { Solution } from '../../solutions/types';

export const solutions: Solution[] = [
    {
        title: 'Выезд',
        price: 'бесплатно',
        bold: true,
    },
    {
        title: 'Диагностика',
        price: 500,
    },
    {
        title: 'Разборка/сборка техники',
        price: 1000,
    },
    {
        title: 'Замена контакта электроцепи',
        price: 400,
    },
    {
        title: 'Оттайка феном',
        price: 400,
    },
    {
        title: 'Замена сенсорного датчика',
        price: 600,
    },
    {
        title: 'Монтаж-демонтаж встроенного холодильника',
        price: 600,
    },
    {
        title: 'Замена компрессора',
        price: 1000,
    },
    {
        title: 'Замена испарителя',
        price: 4000,
    },
    {
        title: 'Замена конденсатора',
        price: 2000,
    },
    {
        title: 'Замена капиллярной трубки',
        price: 1400,
    },
    {
        title: 'Замена термореле',
        price: 900,
    },
    {
        title: 'Замена пускозащитного реле',
        price: 900,
    },
    {
        title: 'Замена блока управления (электронного модуля)',
        price: 800,
    },
    {
        title: 'Замена двигателя вентиляторов',
        price: 600,
    },
    {
        title: 'Ремонт платы управления (электронного модуля)',
        price: '800-4000',
    },
    {
        title: 'Замена дефростера',
        price: 600,
    },
    {
        title: 'Замена шлейфа (блока управления)',
        price: 400,
    },
    {
        title: 'Замена соленоидного (магнитного) клапана',
        price: 1600,
    },
    {
        title: 'Замена фильтра осушителя',
        price: 1000,
    },
    {
        title: 'Замена заслонки',
        price: 800,
    },
    {
        title: 'Замена привода(ов) заслонки',
        price: 600,
    },
    {
        title: 'Замена ТЭНа',
        price: 1600,
    },
    {
        title: 'Замена датчиков испарителя',
        price: 1600,
    },
    {
        title: 'Замена плавких предохранителей',
        price: 1200,
    },
    {
        title: 'Замена таймера оттайки (система No Frost)',
        price: 1400,
    },
    {
        title: 'Замена вентилятора (системы No Frost)',
        price: 800,
    },
    {
        title: 'Ремонт испарителя (пайка)',
        price: 600,
    },
    {
        title: 'Ремонт конденсатора (пайка)',
        price: 600,
    },
    {
        title: 'Устранение засора капиллярной трубки',
        price: 1400,
    },
    {
        title: 'Заправка фреона',
        price: 1600,
    },
    {
        title: 'Разморозка системы No Frost',
        price: 1000,
    },
    {
        title: 'Чистка дренажной системы',
        price: 400,
    },
    {
        title: 'Удаление влаги из системы',
        price: 1200,
    },
    {
        title: 'Замена блока индикаторов',
        price: 1000,
    },
    {
        title: 'Замена датчика температуры',
        price: 800,
    },
    {
        title: 'Замена уплотнителя двери',
        price: 3000,
    },
    {
        title: 'Замена петель холодильника',
        price: 500,
    },
    {
        title: 'Замена регулятора температуры',
        price: 800,
    },
    {
        title: 'Замена электронного модуля',
        price: 1600,
    },
];
