import { Solution } from '../../solutions/types';

export const solutions: Solution[] = [
    {
        title: 'Выезд',
        price: 'бесплатно',
        bold: true,
    },
    {
        title: 'Диагностика',
        price: 500,
    },
    {
        title: 'Разборка/сборка техники',
        price: 1000,
    },
    {
        title: 'Извлечение техники из мебели',
        price: 600,
    },
    {
        title: 'Замена контакта электроцепи',
        price: 300,
    },
    {
        title: 'Чистка патрубка',
        price: 300,
    },
    {
        title: 'Замена хомута патрубка',
        price: 300,
    },
    {
        title: 'Герметизация патрубка',
        price: 300,
    },
    {
        title: 'Разблокировка двери СМА',
        price: 600,
    },
    {
        title: 'Удаление воды из СМА',
        price: 600,
    },
    {
        title: 'Пайка контактов электроцепи',
        price: 300,
    },
    {
        title: 'Диагностика электронного модуля (платы управления) в специализированном стационарном сервисном центре исполнителя, звлечение электронного модуля из СМ',
        price: 1800,
    },
    {
        title: 'Замена (ремонт) электронного модуля, блока индикации, обновление программного обеспечения внутренней памяти микроконтроллеров, применяемых в электронных модулях (ЭМ) и платах панелей управления',
        price: '800-3000',
    },
    {
        title: 'Чистка фильтра заливного шланга',
        price: 300,
    },
    {
        title: 'Чистка фильтра сливного насоса',
        price: 300,
    },
    {
        title: 'Замена аквастопа (гидростопа)',
        price: 600,
    },
    {
        title: 'Замена сливного насоса',
        price: 600,
    },
    {
        title: 'Замена электро-двигателя',
        price: 600,
    },
    {
        title: 'Замена угольных щеток в электродвигателе',
        price: 1200,
    },
    {
        title: 'Вскрытие двери загрузочного люка (без ремонта прибора)',
        price: 1100,
    },
    {
        title: 'Замена фена сушильного устройства',
        price: 1100,
    },
    {
        title: 'Замена кнопки включения',
        price: 1100,
    },
    {
        title: 'Замена сетевого фильтра',
        price: 300,
    },
    {
        title: 'Замена конденсатора',
        price: 300,
    },
    {
        title: 'Замена сетевого шнура',
        price: 300,
    },
    {
        title: 'Замена ремня',
        price: 1000,
    },
    {
        title: 'Замена шкива барабана',
        price: 800,
    },
    {
        title: 'Замена ТЭНа сушильного устройства',
        price: 1200,
    },
    {
        title: 'Замена пружин подвески',
        price: 200,
    },
    {
        title: 'Замена таймера сушильного устройства',
        price: 1000,
    },
    {
        title: 'Замена амортизаторов',
        price: 600,
    },
    {
        title: 'Замена мотора-вентилятора сушильного устройства',
        price: 1000,
    },
    {
        title: 'Замена ТЭНа',
        price: 1000,
    },
    {
        title: 'Замена датчика температуры',
        price: 600,
    },
    {
        title: 'Замена датчика уровня воды (прессостата)',
        price: 600,
    },
    {
        title: 'Замена заливного клапана, КЭН',
        price: 600,
    },
    {
        title: 'Замена блокировки люка, УБЛ',
        price: 600,
    },
    {
        title: 'Замена крепления люка',
        price: 1000,
    },
    {
        title: 'Замена стекла люка',
        price: 1600,
    },
    {
        title: 'Замена датчика положения барабана',
        price: 1000,
    },
    {
        title: 'Замена ручки люка',
        price: 1000,
    },
    {
        title: 'Замена люка в сборе',
        price: 1000,
    },
    {
        title: 'Замена манжеты люка уплотнителя дверцы',
        price: 1600,
    },
    {
        title: 'Замена электрического жгута',
        price: 1000,
    },
    {
        title: 'Замена опор, крестовины',
        price: 1000,
    },
    {
        title: 'Замена подшипников барабана (разборный бак)',
        price: 'от 2400',
    },
    {
        title: 'Замена подшипников барабана (неразборный бак)',
        price: 'от 3400',
    },
    {
        title: 'Извлечение посторонних предметов из бака',
        price: 1100,
    },
    {
        title: 'Замена верхнего противовеса',
        price: 600,
    },
    {
        title: 'Замена нижнего противовеса',
        price: 600,
    },
    {
        title: 'Очистка от накипи',
        price: 800,
    },
];
