import { Solution } from '../../solutions/types';

export const solutions: Solution[] = [
    {
        title: 'Выезд',
        price: 'бесплатно',
        bold: true,
    },
    {
        title: 'Диагностика',
        price: 500,
    },
    {
        title: 'Разборка/сборка техники',
        price: 1000,
    },
    {
        title: 'Демонтаж + монтаж встроенной техники',
        price: 800,
    },
    {
        title: 'Очистка фильтров',
        price: 400,
    },
    {
        title: 'Чистка заливного фильтра-сеточки',
        price: 400,
    },
    {
        title: 'Замена заливного шланга',
        price: 400,
    },
    {
        title: 'Замена сетевого шнура',
        price: 400,
    },
    {
        title: 'Замена нижнего уплотнителя дверцы',
        price: 400,
    },
    {
        title: 'Замена П-образного уплотнителя дверцы',
        price: 600,
    },
    {
        title: 'Замена кнопки',
        price: 600,
    },
    {
        title: 'Замена сенсора управления',
        price: 800,
    },
    {
        title: 'Замена держателей колёсиков корзины',
        price: 200,
    },
    {
        title: 'Замена колёсиков корзины',
        price: 200,
    },
    {
        title: 'Ремонт или замена петли двери',
        price: 400,
    },
    {
        title: 'Замена датчика соли',
        price: 400,
    },
    {
        title: 'Ремонт или замена пружины дверцы',
        price: 400,
    },
    {
        title: 'Ремонт механизма замка',
        price: 400,
    },
    {
        title: 'Ремонт или замена дозатора моющих средств',
        price: 400,
    },
    {
        title: 'Чистка разбрызгивателя',
        price: 400,
    },
    {
        title: 'Замена разбрызгивателя',
        price: 400,
    },
    {
        title: 'Регулировка прессостата (реле уровня воды)',
        price: 400,
    },
    {
        title: 'Замена ТЭНа',
        price: 600,
    },
    {
        title: 'Замена сливного насоса',
        price: 600,
    },
    {
        title: 'Замена циркуляционного насоса',
        price: 1200,
    },
    {
        title: 'Разблокировка циркуляционного насоса',
        price: 700,
    },
    {
        title: 'Поиск и устранение засора в сливном тракте',
        price: 600,
    },
    {
        title: 'Замена замка двери (УБЛ)',
        price: 600,
    },
    {
        title: 'Замена прессостата (датчика уровня)',
        price: 600,
    },
    {
        title: 'Замена заливного клапана (КЭНа)',
        price: 600,
    },
    {
        title: 'Замена блока управления или индикации',
        price: 1100,
    },
    {
        title: 'Диагностика платы управления или индикации',
        price: 1600,
    },
    {
        title: 'Ремонт платы управления или индикации',
        price: '800-3000',
    },
    {
        title: 'Замена пускового конденсатора циркуляционного насоса',
        price: 600,
    },
    {
        title: 'Замена расходомера (датчика протока воды)',
        price: 600,
    },
    {
        title: 'Замена датчика мутности',
        price: 600,
    },
    {
        title: 'Ремонт теплообменника (чистка, замена клапана спуска и др.)',
        price: 600,
    },
    {
        title: 'Замена проточного нагревательного элемента (ТЭНа)',
        price: 1400,
    },
    {
        title: 'Замена бачка для соли',
        price: 600,
    },
    {
        title: 'Замена панели управления',
        price: 600,
    },
    {
        title: 'Ремонт стакана моечного бака (ремкомплект)',
        price: 600,
    },
    {
        title: 'Ремонт или замена системы защиты от протечек',
        price: 800,
    },
    {
        title: 'Ремонт или замена патрубка',
        price: 600,
    },
    {
        title: 'Замена датчика температуры или термостата',
        price: 600,
    },
    {
        title: 'Ремонт электропроводки',
        price: 400,
    },
    {
        title: 'Замена водоприёмника (картера)',
        price: 600,
    },
    {
        title: 'Замена улитки (стакана-отстойника) циркуляционного насоса',
        price: 1600,
    },
    {
        title: 'Замена моечного бака',
        price: 1600,
    },
];
